package 백수진;

public class GameRull {
	
		void Rull() {
			System.out.println("┌=============================================================================┐");
			System.out.println("  룰 설명 : 1. 카드는 1~10까지 숫자가 적힌 카드가 있습니다.			 ");		
			System.out.println("         2. 한 라운드에 카드 하나 씩 PC와 플레이어에게 랜덤으로 나누어 줍니다.");
			System.out.println("         3. 플레이어는 자신의 카드만 보고 베팅을 해야합니다.			 ");
			System.out.println("         4. 베팅은 1개부터 가능합니다.						 ");
			System.out.println("         5. 베팅을 포기하실 경우, 무승부시에 게임은 끝납니다.			 ");
			System.out.println("         6. 플레이어의 카드가 더 높을 경우 베팅한 코인의 2배, 낮을 경우 코인은 사라집니다.");
			System.out.println("└=============================================================================┘");
		}
	}
	
	
	
	
	


